[
  {
    "title": "1",
    "order": "1",
    "rank": "1",
    "name": "Flipping it up there against the Packers (2014)",
    "chatter": "Only five players in Seahawks history have thrown a touchdown pass in a post-season game --- Russell Wilson, Jim Zorn, Dave Kreig, Jon Kitna, Matt Hasselbeck, and, well, Jon Ryan. To reset the stage, the Seahawks trailed the Packers 16-0 with less than five minutes remaining in the third quarter when they lined up for an apparent 36-yard field goal attempt by Stephen Hauschka. \n\nBut the Seahawks had been preparing a fake all week if they got a certain look from the Packers. As they lined up for the kick, Ryan saw the alignment the Seahawks wanted and called for the fake, then rolled to his right and heaved a pass to offensive tackle Garry Gilliam – a former college tight end -- for a 19-yard TD that sparked Seattle’s improbable overtime comeback victory. \n\nRyan took much teasing later for the air underneath the ball and the pained expression on his face as he threw it. “One-for-one,’’ he said after the game, gloating, “There are no pictures on the stat sheet,’’ though he also referred to the pass as “flipping it up there.’’ Ryan celebrated the play heartily, doing a “discount double check’’ -- Aaron Rodgers’ signature move -- in the direction of the Green Bay sideline. \n\nRyan said later he’d envisioned such a moment ever since the Packers had released him in 2008, which led to his eventual signing with the Seahawks. The completion gives Ryan a career postseason passer rating of 158.3, the highest possible. \n<h2>WATCH</h2><iframe src=https://www.youtube.com/embed/3jK8lWaFpW0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe> ",
    "image": "1GreenBay.jpg",
    "credit": "Mike Siegel / The Seattle Times"
  },
  {
    "title": "2",
    "order": "2",
    "rank": "2",
    "name": "Channeling his inner Walter Payton (2014)",
    "chatter": "A former college receiver at the University of Regina, Ryan basked in any opportunity to show off his athleticism. \n\nOne came in the fourth quarter of a Monday night game at Washington in 2014 with Seattle clinging to a 17-10 lead, and lining up for a 49-yard field goal on the notoriously sketchy FedEx Field turf.\n\nAgain seeing a look the team had practiced all week -- specifically, four defenders to one side and seven to the other -- Ryan called a fake, took the snap and then darted up the middle, gaining five yards and a first down. Seattle scored a TD a few plays later to clinch a 27-17 win.\n\nAsked afterward about the run, Ryan said it was “Walter Payton-like.”\n\nIt was the second-longest run of his NFL career to that point. It would end up moving down the list a few years later.\n",
    "image": "2JonRyanFake.jpg",
    "credit": "Bettina Hansen / The Seattle Times"
  },
  {
    "title": "3",
    "order": "3",
    "rank": "3",
    "name": "\"MVP\" against the Broncos (2014)",
    "chatter": "From a strictly punting standpoint, Ryan’s best game might have come against Denver in 2014, in a rematch of the previous year’s Super Bowl.\n\nIn Seattle’s eventual 26-20 overtime win, Ryan averaged 50.2 yards on six punts, five of which were downed inside the 20. He also had a 79-yarder on a free kick following a safety. \n\nAfterward Carroll said Ryan “might have been” the MVP of the game for continually giving the Broncos long fields.\n\nIn 2012, Ryan also set a team record for highest average in a game, averaging 60 yards on four kicks in a 24-23 win over the Patriots, the famous “You Mad Bro’” game. It was the first time since 1946 a punter averaged 60 or more yards with at least four punts and only the third time in NFL history.\n",
    "image": "3RyanHawksBroncos.jpg",
    "credit": "Lindsey Wasson / The Seattle Times"
  },
  {
    "title": "4",
    "order": "4",
    "rank": "4",
    "name": "A fake and a headache against the Rams (2016)",
    "chatter": "What might be Ryan’s most memorable run ended in infamy -- a 26-yard gain against the Rams on a Thursday night in 2016 wearing dayglo uniforms and with Ryan losing the ball untouched as he crossed midfield, then taking a hard hit and suffering a concussion.\n\nAnd all with Seattle holding a 24-3 lead, with 5:22 left in a game that seemed no longer in doubt.\n\nCarroll took some heat for the call later, and some thought he was maybe rubbing it in against a Rams team that, during the Jeff Fisher era, was known for regularly pulling off fakes and special teams gadget plays against Seattle.\n\n“You’re either competing or you’re not,’’ Carroll said.\n\nRyan was being treated and wasn’t around for comment immediately after the game. But his wife, comedian Sarah Colonna, spoke for him, saying via Twitter that he was fine and had “a bit of a headache and (is) excited to have a beer later.”\n<h2>WATCH</h2><iframe src=\"https://www.youtube.com/embed/xrw0xqykXdM\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>",
    "image": "4JonRyanRams.jpg",
    "credit": "Bettina Hansen / The Seattle Times"
  },
  {
    "title": "5",
    "order": "5",
    "rank": "5",
    "name": "",
    "chatter": "Speaking of Sarah Colonna, Ryan was a fan of the comedian for years, largely through watching her frequent appearances on “Chelsea Lately.” While standing on the sidelines before the Seahawks’ seminal NFC title game win over the 49ers in 2014, Ryan happened to recognize another familiar face from that show -- self-proclaimed Seahawks super fan Ross Mathews.\n\nThere was a game to play but Ryan wasn’t going to miss his big chance. He asked Mathews to “put in a good word for me” the next time he saw Colonna. \n\n “I had a little crush on her,” Ryan said later of approaching Matthews to be his wingman. “From there I kind of stalked her on Twitter until she gave in and let me take her on a date in (Los Angeles).”\n\nThe two got married on July 10, 2016.",
    "image": "5JonRyanSideline.jpg",
    "credit": "Bettina Hansen / The Seattle Times"
  }
]